import torch

tensor1 = torch.Tensor([0, 1, 2, 3, 4, 7, 8, 5, 0, 2, 4, 0, 7, 3, 2, 4, 1, 8, 0, 6, 2, 7, 4, 8,
        6, 2, 1, 7, 7, 9, 2, 4, 6, 7, 7, 6, 9, 9, 1, 8, 6, 4, 6, 0, 9, 2, 6, 4,
        3, 9, 0, 8, 8, 9, 4, 7, 1, 3, 6, 9, 4, 1, 7, 6])
tensor2 = torch.Tensor([0, 1, 2, 3, 4, 7, 8, 5, 0, 2, 4, 0, 7, 3, 2, 4, 1, 8, 0, 6, 2, 7, 4, 8,
        6, 2, 1, 7, 7, 9, 2, 4, 6, 7, 7, 6, 9, 9, 1, 8, 6, 4, 6, 0, 9, 2, 6, 4,
        3, 9, 0, 8, 8, 9, 4, 7, 1, 3, 6, 1, 4, 1, 2, 6])

correct = 0
correct += (tensor1 == tensor2).sum().item()
print(correct)
tensor1_s = tensor1.sum()  #对张量tensor1的值求和
print(tensor1_s)